app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("description", "spot_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    review = @spot.reviews.create(review_param)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "description" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["description", "new description"], ["updated_at", "2023-02-12 20:28:30.570518"], ["id", 3]]
---
  def update
    review = Review.find(params[:id])
    review.update(review_param)

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 1963], ["LIMIT", 1]]
---
  def set_spot
    @spot = Spot.find(params[:spot_id])