app/controllers/spots_controller.rb

SELECT "spots".* FROM "spots" ORDER BY created_at DESC
---
  def index
    spots = Spot.order('created_at DESC')

INSERT INTO "spots" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["description", nil], ["price", nil], ["created_at", "2023-02-12 16:10:06.615346"], ["updated_at", "2023-02-12 16:10:06.615346"]]
---
  def create
    spot = Spot.create(spot_param)

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    spot = Spot.find(params[:id])

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "spots" SET "title" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["title", "updated value"], ["updated_at", "2023-02-12 21:41:01.749557"], ["id", 5]]
---
  def update
    spot = Spot.find(params[:id])
    spot.update(update_spot_param)

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "spots" WHERE "spots"."id" = $1  [["id", 5]]
---
  def destroy
    spot = Spot.find(params[:id])
    spot.destroy